In [1]:
import pandas as pd

import numpy as np

In [3]:
inside = ["class A" ,"class B","class C", "class A" , "class B" ,"class C" ]
outside = ["school 1" ,"school 1","school 1","school 2","school 2","school 2"]

In [4]:
zip(outside,inside)

In [5]:
multi_index  = list(zip(outside,inside))

In [6]:
multi_index

[('school 1', 'class A'),
 ('school 1', 'class B'),
 ('school 1', 'class C'),
 ('school 2', 'class A'),
 ('school 2', 'class B'),
 ('school 2', 'class C')]

In [7]:
hier_index = pd.MultiIndex.from_tuples(multi_index)

In [8]:
hier_index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ('school 2', 'class A'),
            ('school 2', 'class B'),
            ('school 2', 'class C')],
           )

In [10]:
np.random.seed(101)

df = pd.DataFrame(np.random.randint(70,100 ,size=(6,2)),index= hier_index , columns= (["1st_semester", "2nd_semester"]))

df

                  1st_semester  2nd_semester
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [11]:
df["1st_semester"]

school 1  class A    81
          class B    76
          class C    99
school 2  class A    85
          class B    83
          class C    74
Name: 1st_semester, dtype: int32

In [12]:
df[["1st_semester"]]

                  1st_semester
school 1 class A            81
         class B            76
         class C            99
school 2 class A            85
         class B            83
         class C            74

In [13]:
df[["2nd_semester"]]

                  2nd_semester
school 1 class A            87
         class B            93
         class C            81
school 2 class A            79
         class B            78
         class C            78

In [15]:
df.loc["school 1"]

         1st_semester  2nd_semester
class A            81            87
class B            76            93
class C            99            81

In [16]:
df.loc["school 1"].loc["class B"]

1st_semester    76
2nd_semester    93
Name: class B, dtype: int32

In [17]:
df.loc["school 1"].loc[["class B"]]

         1st_semester  2nd_semester
class B            76            93

In [18]:
df.index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ('school 2', 'class A'),
            ('school 2', 'class B'),
            ('school 2', 'class C')],
           )

In [20]:
df.index.names

FrozenList([None, None])

In [21]:
df.index.names = ["schools","classes"]

In [22]:
df

                  1st_semester  2nd_semester
schools  classes
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [23]:
df.xs("school 2")

         1st_semester  2nd_semester
classes
class A            85            79
class B            83            78
class C            74            78

In [24]:
df.xs(("school 2", "class A"))

1st_semester    85
2nd_semester    79
Name: (school 2, class A), dtype: int32

In [25]:
df

                  1st_semester  2nd_semester
schools  classes
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [26]:
df.xs(("school 2", "class A"),level= [0, 1])

                  1st_semester  2nd_semester
schools  classes
school 2 class A            85            79

In [27]:
df.xs("class A" , level= "classes")

          1st_semester  2nd_semester
schools
school 1            81            87
school 2            85            79

In [28]:
df.xs("class A" , level= 1)

          1st_semester  2nd_semester
schools
school 1            81            87
school 2            85            79